# git - cистема контроля версий 

# github/gitlab/bitbucket - хранилище или сайт для хранения версий кода 

# repository - папка в которой, git отслеживает изменения 

# git init - создание репозитория 

# git status - проверка статуса отслеживания

# git add 'filename' or . - добавление файла в список отслеживания

# git commit -m 'some message' - создание или фиксация версий кода с сообщением 

# git commit -am 'some message' - добавление файла в список отслеживания и фиксация версии кода с сообщением

# git remote add 'variable_name or origin' 'ссылка на удаленный репозиторий' - связка локального репозитория с удаленным и сохранение ссылки в переменную 

# git push origin 'branch_name' - отправка версии кода в
#  удаленный репозиторий

# git branch - вывод списка веток 

# git branch 'name_branch' - создание новой ветки 

# git checkout 'branch_name' - переход на другую ветку

# ветка или branch - копия кода независимая от основной рабочей версии

# git checkout -b  'branch_name' - создание новой ветки и переключение на нее 

# git merge 'branch name' - склеивание веток. склеивает указанную ветку к текущей 

# git pull origin 'branch name' - загрузить изменения которые произошли на гитхабе

# git restore - обновить код
 
# git clone 'ссылка на репозиторий' - чтобы клонировать чей то репозиторий к себе локально 

