# git - cистема контроля версий 

# github/gitlab/bitbucket - хранилище или сайт для хранения версий кода 

# repository - папка в которой, git отслеживает изменения 

# git init - создание репозитория 

# git status - проверка статуса отслеживания

# git add 'filename' or . - добавление файла в список отслеживания

# git commit -m 'some message' - создание или фиксация версий кода с сообщением 

# git remote add 'variable_name or origin' 'ссылка на удаленный репозиторий' - связка локального репозитория с удаленным и сохранение ссылки в переменную 

# git push origin 'branch_name' - отправка версии кода в удаленный репозиторий
